Reddit/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hanna"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password) #used for sign in page
        @user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-05-11 17:35:06.077572"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!