Reddit/app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-05-11 18:39:04.374474"], ["id", 1]]
---
    def create
        @user = User.find_by_credentials(params[:user][:username], params[:user][:password])
        if @user.save